using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Linq;
using System.Text;

namespace ChuangLiTou.Core.Helpers
{
    public enum EnumCode
    {
        [Description("成功 ")]
        成功 = 0,
        [Description("请求参数非法")]
        请求参数非法 = 100,
        [Description("验证签名失败")]
        验证签名失败 = 101,
        [Description("加签名失败")]
        加签名失败 = 102,
		[Description("没有对应的验签方式")]
        没有对应的验签方式 = 104,
		[Description("json字符串转换对象失败")]
        json字符串转换对象失败 = 105,
		[Description("对象转换json字符串失败")]
        对象转换json字符串失败 = 106,
		[Description("从json字符串找到指定参数值失败")]
        从json字符串找到指定参数值失败 = 107,
		[Description("重复交易")]
        重复交易 = 107,
		[Description("用户未登录")]
        用户未登录 = 200,
		[Description("商户或用户不存在")]
        商户或用户不存在 = 201,
		[Description("此商户不存在")]
        此商户不存在 = 202,
		[Description("此用户不存在")]
        此用户不存在 = 203,
		[Description("商户或用户状态不正常")]
        商户或用户状态不正常 = 204,
		[Description("商户状态不正常")]
        商户状态不正常 = 205,
		[Description("用户状态不正常")]
        用户状态不正常 = 206,
		[Description("用户状态未实名")]
        用户状态未实名 = 207,
		[Description("用户被锁")]
        用户被锁 = 208,
		[Description("用户未激活")]
        用户未激活 = 209,
		[Description("用户在商户下不存在")]
        用户在商户下不存在 = 210,
		[Description("用户在商户下已关闭")]
        用户在商户下已关闭 = 211,
		[Description("用户不是P2P类型商户")]
        用户不是P2P类型商户 = 212,
		[Description("错误次数超过限制交易密码已被锁定")]
        错误次数超过限制交易密码已被锁定 = 213,
		[Description("审核处理中不允许商户重复提交注册")]
        审核处理中不允许商户重复提交注册 = 214,
		[Description("用户角色不支持转账")]
        用户角色不支持转账 = 215,
		[Description("企业用户注册信息不存在")]
        企业用户注册信息不存在 = 216,
		[Description("企业用户注册审核拒绝")]
        企业用户注册审核拒绝 = 217,
		[Description("企业用户注册审核中")]
        企业用户注册审核中 = 218,
		[Description("企业用户注册已提交待审核")]
        企业用户注册已提交待审核 = 219,
		[Description("已开户成功不允许商户重复提交注册")]
        已开户成功不允许商户重复提交注册 = 220,
		[Description("开户失败、汇付处理中不允许商户重复提交注册")]
        开户失败汇付处理中不允许商户重复提交注册 = 221,
		[Description("开户中不允许商户重复提交注册")]
        开户中不允许商户重复提交注册 = 222,
		[Description("没有生利宝记录")]
        没有生利宝记录 = 223,
		[Description("生利宝账户信息查询失败")]
        生利宝账户信息查询失败 = 224,
		[Description("生利宝产品信息查询失败")]
        生利宝产品信息查询失败 = 225,
		[Description("投资用户在本商户下不存在")]
        投资用户在本商户下不存在 = 301,
		[Description("投资用户在本商户下已关闭")]
        投资用户在本商户下已关闭 = 302,
		[Description("借款用户在本商户下不存在")]
        借款用户在本商户下不存在 = 303,
		[Description("借款用户在本商户下已关闭")]
        借款用户在本商户下已关闭 = 304,
		[Description("商户不能为投资人")]
        商户不能为投资人 = 307,
		[Description("商户不能为借款人")]
        商户不能为借款人 = 308,
		[Description("投资人不能为借款人")]
        投资人不能为借款人 = 309,
		[Description("借款金额总和不等于投标金额")]
        借款金额总和不等于投标金额 = 310,
		[Description("商户配置信息不存在")]
        商户配置信息不存在 = 311,
		[Description("投资手续费率超过商户限额")]
        投资手续费率超过商户限额 = 312,
		[Description("借款手续费超过商户限额")]
        借款手续费超过商户限额 = 313,
		[Description("添加投标信息异常")]
        添加投标信息异常 = 314,
		[Description("更新投标信息异常")]
        更新投标信息异常 = 315,
		[Description("交易密码错误")]
        交易密码错误 = 316,
		[Description("投标记录不存在")]
        投标记录不存在 = 317,
		[Description("投标记录状态异常")]
        投标记录状态异常 = 318,
		[Description("投标类型错误")]
        投标类型错误 = 319,
		[Description("投标记录匹配异常")]
        投标记录匹配异常 = 320,
		[Description("投标记录已放款")]
        投标记录已放款 = 321,
		[Description("投标已确认")]
        投标已确认 = 322,
		[Description("投标记录匹配用户不正确")]
        投标记录匹配用户不正确 = 323,
		[Description("分标记录下不存在")]
        分标记录下不存在 = 324,
		[Description("分标记录状态异常")]
        分标记录状态异常 = 325,
		[Description("投标记录匹配异常")]
        投标记录匹配异常A = 326,
		[Description("投标计划设置异常")]
        投标计划设置异常 = 327,
		[Description("自动投标计划不存在")]
        自动投标计划不存在 = 328,
		[Description("自动投标计划状态异常")]
        自动投标计划状态异常 = 329,
		[Description("自动投标计划已关闭")]
        自动投标计划已关闭 = 330,
		[Description("自动投标计划类型错误")]
        自动投标计划类型错误 = 331,
		[Description("投资金额超过自动投标计划上限")]
        投资金额超过自动投标计划上限 = 332,
		[Description("手续费不等于分账给各账户的资金总额")]
        手续费不等于分账给各账户的资金总额 = 333,
		[Description("已放款金额加本次放款金额超过投资人原单中的投资金额")]
        已放款金额加本次放款金额超过投资人原单中的投资金额 = 334,
		[Description("已扣除手续费加本次扣除手续费超过原单中的投资金额乘以投资手续费率")]
        已扣除手续费加本次扣除手续费超过原单中的投资金额乘以投资手续费率 = 335,
		[Description("放款金额超过借款金额")]
        放款金额超过借款金额 = 336,
		[Description("账户不存在")]
        账户不存在 = 337,
		[Description("账户关闭")]
        账户关闭 = 338,
		[Description("转出账户为保证金账户")]
        转出账户为保证金账户 = 339,
		[Description("转入转出为同一账户")]
        转入转出为同一账户 = 340,
		[Description("银行卡不存在")]
        银行卡不存在 = 341,
		[Description("银行卡关闭")]
        银行卡关闭 = 342,
		[Description("出账用户余额不足")]
        出账用户余额不足 = 343,
		[Description("添加放款记录失败")]
        添加放款记录失败 = 344,
		[Description("重复的放款请求")]
        重复的放款请求 = 345,
		[Description("完成放款失败")]
        完成放款失败 = 346,
		[Description("还款资金流向不对")]
        还款资金流向不对 = 347,
		[Description("本次垫付金额加上已垫付金额超过还款总额")]
        本次垫付金额加上已垫付金额超过还款总额 = 348,
		[Description("本次还款金额加上已还款金额超过还款总额")]
        本次还款金额加上已还款金额超过还款总额 = 349,
		[Description("添加还款记录失败")]
        添加还款记录失败 = 350,
		[Description("重复的还款请求")]
        重复的还款请求 = 351,
		[Description("完成还款失败")]
        完成还款失败 = 352,
		[Description("放款失败")]
        放款失败 = 353,
		[Description("还款失败")]
        还款失败 = 354,
		[Description("重复的转账请求")]
        重复的转账请求 = 355,
		[Description("转账失败")]
        转账失败 = 356,
		[Description("冻结请求已经被解冻")]
        冻结请求已经被解冻 = 357,
		[Description("冻结失败")]
        冻结失败 = 358,
		[Description("解冻失败")]
        解冻失败 = 359,
		[Description("存在一笔相同订单号的冻结记录")]
        存在一笔相同订单号的冻结记录 = 360,
		[Description("用户账户不存在或状态异常")]
        用户账户不存在或状态异常 = 361,
		[Description("商户账户不存在或状态异常")]
        商户账户不存在或状态异常 = 362,
		[Description("投标失败")]
        投标失败 = 363,
		[Description("余额不足")]
        余额不足 = 364,
		[Description("投资人和借款人不能同时企业用户")]
        投资人和借款人不能同时企业用户 = 365,
		[Description("投资人不能为担保类型")]
        投资人不能为担保类型 = 366,
		[Description("借款人不能为担保类型")]
        借款人不能为担保类型 = 367,
		[Description("商户不能为转让人")]
        商户不能为转让人 = 368,
		[Description("商户不能为承接人")]
        商户不能为承接人 = 369,
		[Description("转让人不能为承接人")]
        转让人不能为承接人 = 370,
		[Description("转让金额或手续费不匹配")]
        转让金额或手续费不匹配 = 371,
		[Description("转让用户不匹配")]
        转让用户不匹配 = 372,
		[Description("原始订单不匹配或状态异常")]
        原始订单不匹配或状态异常 = 373,
		[Description("承接人和借款人不能同时为企业用户")]
        承接人和借款人不能同时为企业用户 = 374,
		[Description("实际成交金额超过限额")]
        实际成交金额超过限额 = 375,
		[Description("转让手续费超过限额")]
        转让手续费超过限额 = 376,
		[Description("添加债权转让记录失败")]
        添加债权转让记录失败 = 377,
		[Description("债权转让转账失败")]
        债权转让转账失败 = 378,
		[Description("更新债权转让状态失败")]
        更新债权转让状态失败 = 379,
		[Description("债权转让金额超过可转让金额")]
        债权转让金额超过可转让金额 = 380,
		[Description("订单号重复")]
        订单号重复 = 381,
		[Description("承接人不能为借款人")]
        承接人不能为借款人 = 382,
		[Description("已还本金非法")]
        已还本金非法 = 383,
		[Description("自动债权转让计划不存在")]
        自动债权转让计划不存在 = 384,
		[Description("自动债权转让计划状态异常")]
        自动债权转让计划状态异常 = 385,
		[Description("自动债权转让计划已关闭")]
        自动债权转让计划已关闭 = 386,
		[Description("自动债权转让计划类型错误")]
        自动债权转让计划类型错误 = 387,
		[Description("投资金额超过自动债权转让计划上限")]
        投资金额超过自动债权转让计划上限 = 388,
		[Description("使用代金券金额大于投标代金券金额")]
        使用代金券金额大于投标代金券金额 = 392,
		[Description("投资人出账户金额大于本应出款金额")]
        投资人出账户金额大于本应出款金额 = 393,
		[Description("标的信息已存在")]
        标的信息已存在 = 395,
		[Description("标的信息不存在")]
        标的信息不存在 = 396,
		[Description("与标的信息中借款人信息不一致")]
        与标的信息中借款人信息不一致 = 398,
		[Description("原投标中有项目编号放款还款债权转让时项目编号ProId为必须")]
        原投标中有项目编号放款还款债权转让时项目编号ProId为必须 = 399,
		[Description("取现失败")]
        取现失败 = 400,
		[Description("重复取现申请,取现失败")]
        重复取现申请取现失败 = 401,
		[Description("专属账户查询异常")]
        专属账户查询异常 = 402,
		[Description("余额不足,取现失败")]
        余额不足取现失败 = 403,
		[Description("历史取现记录查询异常")]
        历史取现记录查询异常 = 404,
		[Description("历史充值记录查询异常")]
        历史充值记录查询异常 = 405,
		[Description("当前取现卡不存在取现失败")]
        当前取现卡不存在取现失败 = 406,
		[Description("当前取现卡未实名取现失败")]
        当前取现卡未实名取现失败 = 407,
		[Description("当前取现卡姓名不一致取现失败")]
        当前取现卡姓名不一致取现失败 = 408,
		[Description("查询取现卡异常取现失败")]
        查询取现卡异常取现失败 = 409,
		[Description("当前用户无可用的取现银行卡取现失败")]
        当前用户无可用的取现银行卡取现失败 = 410,
		[Description("当前取现通道取现配置信息不存在")]
        当前取现通道取现配置信息不存在 = 411,
		[Description("当前取现通道取现异常")]
        当前取现通道取现异常 = 412,
		[Description("直连银行卡校验失败")]
        直连银行卡校验失败 = 413,
		[Description("手续费计算失败")]
        手续费计算失败 = 414,
		[Description("取现申请信息不存在")]
        取现申请信息不存在 = 415,
		[Description("该订单已完成审核")]
        该订单已完成审核 = 416,
		[Description("充值手续费配置不存在")]
        充值手续费配置不存在 = 417,
		[Description("充值手续费计算失败")]
        充值手续费计算失败 = 418,
		[Description("可解冻的冻结交易不存在")]
        可解冻的冻结交易不存在 = 419,
		[Description("当前取现卡不支持直连取现")]
        当前取现卡不支持直连取现 = 420,
		[Description("借款交易记录不存在")]
        借款交易记录不存在 = 421,
		[Description("还款交易记录不存在")]
        还款交易记录不存在 = 422,
		[Description("商户转账交易记录不存在")]
        商户转账交易记录不存在 = 423,
		[Description("不支持的对账查询类型")]
        不支持的对账查询类型 = 424,
		[Description("用户没有真实的手机号")]
        用户没有真实的手机号 = 425,
		[Description("审核金额与申请金额不一致")]
        审核金额与申请金额不一致 = 426,
		[Description("验卡银行错误")]
        验卡银行错误 = 427,
		[Description("验卡失败")]
        验卡失败 = 428,
		[Description("代发验卡处理中")]
        代发验卡处理中 = 429,
		[Description("当前取现卡实名失败取现失败")]
        当前取现卡实名失败取现失败 = 430,
		[Description("账户可取金额不足或手续费账户余额不足取现失败")]
        账户可取金额不足或手续费账户余额不足取现失败 = 431,
		[Description("当前卡不能作为取现卡,取现失败")]
        当前卡不能作为取现卡取现失败 = 432,
		[Description("取现正在处理中")]
        取现正在处理中 = 433,
		[Description("取现页面数据数据被篡改")]
        取现页面数据数据被篡改 = 434,
		[Description("最大商户服务费率未配置")]
        最大商户服务费率未配置 = 435,
		[Description("商户服务费不合法")]
        商户服务费不合法 = 436,
		[Description("商户规则未配置")]
        商户规则未配置 = 501,
		[Description("银行卡号已存在")]
        银行卡号已存在 = 502,
		[Description("不是取现银行")]
        不是取现银行 = 503,
		[Description("用户未实名绑卡失败")]
        用户未实名绑卡失败 = 504,
		[Description("省份地区不存在")]
        省份地区不存在 = 505,
		[Description("身份证和姓名校验失败")]
        身份证和姓名校验失败 = 506,
		[Description("该商户配置开户时不允许传递的手机号为空")]
        该商户配置开户时不允许传递的手机号为空 = 507,
		[Description("手机号在该商户下已存在")]
        手机号在该商户下已存在 = 508,
		[Description("证件号在该商户下已存在")]
        证件号在该商户下已存在 = 509,
		[Description("用户名必须是6-25位的英文数字特殊字符@._-组合")]
        用户名必须是位的英文数字特殊字符组合 = 510,
		[Description("密码必须是6-16位半角字符")]
        密码必须是位半角字符 = 511,
		[Description("新密码不能与原密码一致")]
        新密码不能与原密码一致 = 512,
		[Description("用户操作员信息异常")]
        用户操作员信息异常 = 513,
		[Description("密码更新失败")]
        密码更新失败 = 514,
		[Description("密码加密异常")]
        密码加密异常 = 515,
		[Description("商户没有开通权限")]
        商户没有开通权限 = 516,
		[Description("商户接口权限已关闭")]
        商户接口权限已关闭 = 517,
		[Description("收费手续费配置错误")]
        收费手续费配置错误 = 518,
		[Description("收费手续费账户错误")]
        收费手续费账户错误 = 519,
		[Description("收费手续费账户余额不足")]
        收费手续费账户余额不足 = 520,
		[Description("用户在该商户下已存在")]
        用户在该商户下已存在 = 521,
		[Description("代扣卡不存在")]
        代扣卡不存在 = 522,
		[Description("代扣卡状态不正常")]
        代扣卡状态不正常 = 523,
		[Description("商户无卡代扣配置信息不存在")]
        商户无卡代扣配置信息不存在 = 524,
		[Description("充值金额超过单笔金额上限")]
        充值金额超过单笔金额上限 = 525,
		[Description("充值笔数超过单卡总笔数上限")]
        充值笔数超过单卡总笔数上限 = 526,
		[Description("充值金额超过单卡总金额上限")]
        充值金额超过单卡总金额上限 = 527,
		[Description("充值笔数超过累计总笔数上限")]
        充值笔数超过累计总笔数上限 = 528,
		[Description("充值金额超过累计总金额上限")]
        充值金额超过累计总金额上限 = 529,
		[Description("充值笔数超过单日单卡笔数上限")]
        充值笔数超过单日单卡笔数上限 = 530,
		[Description("充值金额超过单日单卡金额上限")]
        充值金额超过单日单卡金额上限 = 531,
		[Description("充值笔数超过单日单商户笔数上限")]
        充值笔数超过单日单商户笔数上限 = 532,
		[Description("充值金额超过单日单商户金额上限")]
        充值金额超过单日单商户金额上限 = 533,
		[Description("重复的投标请求")]
        重复的投标请求 = 534,
		[Description("充值失败")]
        充值失败 = 535,
		[Description("更新充值累计值失败")]
        更新充值累计值失败 = 536,
		[Description("银行卡未做代扣验证")]
        银行卡未做代扣验证 = 537,
		[Description("重复的充值请求")]
        重复的充值请求 = 538,
		[Description("转入账户不是专属账户")]
        转入账户不是专属账户 = 539,
		[Description("操作超时请重新获取校验码")]
        操作超时请重新获取校验码 = 540,
		[Description("无此绑定卡")]
        无此绑定卡 = 541,
		[Description("默认取现卡不允许删除")]
        默认取现卡不允许删除 = 542,
		[Description("银行卡删除失败")]
        银行卡删除失败 = 543,
		[Description("此银行卡已被删除")]
        此银行卡已被删除 = 544,
		[Description("手续费收款用户类型不正确")]
        手续费收款用户类型不正确 = 545,
		[Description("手续费支付方不能为手续费收取方")]
        手续费支付方不能为手续费收取方 = 546,
		[Description("重复的订单请求")]
        重复的订单请求 = 547,
		[Description("订单不存在或状态异常")]
        订单不存在或状态异常 = 548,
		[Description("同一笔充值订单信息不匹配")]
        同一笔充值订单信息不匹配 = 549,
		[Description("用户后台转账已经授权")]
        用户后台转账已经授权 = 600,
		[Description("用户后台转账未授权")]
        用户后台转账未授权 = 601,
		[Description("用户角色不允许后台转账")]
        用户角色不允许后台转账 = 602,
		[Description("生利宝开户失败")]
        生利宝开户失败 = 603,
		[Description("生利宝转入失败用户为企业用户")]
        生利宝转入失败用户为企业用户 = 604,
		[Description("生利宝转入失败、用户为商户")]
        生利宝转入失败用户为商户 = 605,
		[Description("生利宝转入失败用户非实名用户")]
        生利宝转入失败用户非实名用户 = 606,
		[Description("生利宝转入失败用户未绑卡")]
        生利宝转入失败用户未绑卡 = 607,
		[Description("生利宝交易失败")]
        生利宝交易失败 = 608,
		[Description("转入成功")]
        转入成功 = 609,
		[Description("转出失败")]
        转出失败 = 610,
		[Description("转出处理中")]
        转出处理中 = 611,
		[Description("转入处理中")]
        转入处理中 = 612,
		[Description("没有开通生利宝")]
        没有开通生利宝 = 613,
		[Description("授权金额超限")]
        授权金额超限 = 615,
		[Description("调用生利宝加签文失败")]
        调用生利宝加签文失败 = 616,
		[Description("调用生利宝接口失败")]
        调用生利宝接口失败 = 617,
		[Description("调用生利宝返回验签失败")]
        调用生利宝返回验签失败 = 618,
		[Description("页面签名错误")]
        页面签名错误 = 619,
		[Description("转入失败")]
        转入失败 = 620,
		[Description("状态非法")]
        状态非法 = 621,
		[Description("商户不能作为收款人")]
        商户不能作为收款人 = 630,
		[Description("用户定向支付未授权")]
        用户定向支付未授权 = 631,
		[Description("用户定向支付失败")]
        用户定向支付失败 = 632,
		[Description("交易数据与原订单数据不一致")]
        交易数据与原订单数据不一致 = 997,
		[Description("页面数据被篡改")]
        页面数据被篡改 = 998,
		[Description("请求正在处理中")]
        请求正在处理中 = 999

    }
}
